In [1]:
from pyspark.sql import functions as f

In [2]:
df = (
    spark
    .read
    .options(header=True, sep='|')
    .csv('/home/rafael/Downloads/microdados_educacao_superior_2019/Microdados_Educaç╞o_Superior_2019/dados/SUP_DOCENTE_2019.CSV')
)

In [3]:
df.printSchema()

root
 |-- NU_ANO_CENSO: string (nullable = true)
 |-- CO_IES: string (nullable = true)
 |-- TP_CATEGORIA_ADMINISTRATIVA: string (nullable = true)
 |-- TP_ORGANIZACAO_ACADEMICA: string (nullable = true)
 |-- CO_DOCENTE_IES: string (nullable = true)
 |-- ID_DOCENTE: string (nullable = true)
 |-- TP_SITUACAO: string (nullable = true)
 |-- TP_ESCOLARIDADE: string (nullable = true)
 |-- TP_REGIME_TRABALHO: string (nullable = true)
 |-- TP_SEXO: string (nullable = true)
 |-- NU_ANO_NASCIMENTO: string (nullable = true)
 |-- NU_MES_NASCIMENTO: string (nullable = true)
 |-- NU_DIA_NASCIMENTO: string (nullable = true)
 |-- NU_IDADE: string (nullable = true)
 |-- TP_COR_RACA: string (nullable = true)
 |-- CO_PAIS_ORIGEM: string (nullable = true)
 |-- TP_NACIONALIDADE: string (nullable = true)
 |-- CO_UF_NASCIMENTO: string (nullable = true)
 |-- CO_MUNICIPIO_NASCIMENTO: string (nullable = true)
 |-- IN_DEFICIENCIA: string (nullable = true)
 |-- IN_DEFICIENCIA_CEGUEIRA: string (nullable = true)
 |-- IN_DEFICIENCIA_BAIXA_VISAO: string (nullable = true)
 |-- IN_DEFICIENCIA_SURDEZ: string (nullable = true)
 |-- IN_DEFICIENCIA_AUDITIVA: string (nullable = true)
 |-- IN_DEFICIENCIA_FISICA: string (nullable = true)
 |-- IN_DEFICIENCIA_SURDOCEGUEIRA: string (nullable = true)
 |-- IN_DEFICIENCIA_MULTIPLA: string (nullable = true)
 |-- IN_DEFICIENCIA_INTELECTUAL: string (nullable = true)
 |-- IN_ATUACAO_EAD: string (nullable = true)
 |-- IN_ATUACAO_EXTENSAO: string (nullable = true)
 |-- IN_ATUACAO_GESTAO: string (nullable = true)
 |-- IN_ATUACAO_GRAD_PRESENCIAL: string (nullable = true)
 |-- IN_ATUACAO_POS_EAD: string (nullable = true)
 |-- IN_ATUACAO_POS_PRESENCIAL: string (nullable = true)
 |-- IN_ATUACAO_SEQUENCIAL: string (nullable = true)
 |-- IN_ATUACAO_PESQUISA: string (nullable = true)
 |-- IN_BOLSA_PESQUISA: string (nullable = true)
 |-- IN_SUBSTITUTO: string (nullable = true)
 |-- IN_EXERCICIO_DATA_REFERENCIA: string (nullable = true)
 |-- IN_VISITANTE: string (nullable = true)
 |-- TP_VISITANTE_IFES_VINCULO: string (nullable = true)

In [4]:
df.createOrReplaceTempView('docente')

In [10]:
spark.sql(
'''
    select count(ID_DOCENTE) qtd, CO_UF_NASCIMENTO
    from docente
    where TP_SEXO = '2'
    and TP_COR_RACA = '5'
    group by CO_UF_NASCIMENTO
    order by qtd desc
'''
).toPandas().style

In [8]:
spark.sql(
'''
    select avg(NU_IDADE) qtd
    from docente
    where TP_SEXO = '2'
'''
).toPandas().style

In [11]:
spark.sql(
'''
    select count(ID_DOCENTE) qtd, TP_SEXO
    from docente
    where TP_ESCOLARIDADE = '5'
    group by TP_SEXO
    order by qtd desc
'''
).toPandas().style